export default function UslovniNaKoristenje() {
  return (
    <main>
      <section className="relative max-w-4xl mt-30 text-center">
        <span className="absolute top-0 left-5 text-xs text-gray-500 font-[600]">Последна промена: 22.06.2025</span>
        <h1 className="text-3xl pb-2">Услови на користење</h1>
        <p>Овие Услови на користење важат за сите корисници на Конекта и ја дефинираат нашата меѓусебна доверба.</p>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Што добивате со Конекта</h2>
        <p>Со секоја Конекта визит картичка добивате пристап до ваш личен дигитален профил, кој можете да го ажурирате, прилагодувате и споделувате со други лица преку NFC технологија, QR код или со линк (ваш URL кој води само кон вашиот профил).</p>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Одговорност на корисникот</h2>
        <p>Содржината што ја внесувате е <strong>ваша одговорност.</strong></p>
        <p><strong>Забрането е</strong> поставување лажни информации, споделување на туѓи лични податоци без дозвола, или било каква злоупотреба на платформата.</p>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Промени и одржување</h2>
        <p>Имаме право повремено да направиме промени на системот. За сите значајни промени, ќе ве известиме навремено.</p>
      </section>
      <section className="max-w-4xl mb-20 flex flex-col gap-2">
        <h2>Прекин на користење</h2>
        <p>Секој корисник има право да престане да го користи сервисот во секое време. Исто така, го задржуваме правото да го ограничиме пристапот до профили кои го кршат правилникот или прават штета на платформата или на други корисници.</p>
      </section>
    </main>
  );
}