export default function NacinNaKoristenje() {
  return (
    <main>
      <section className="max-w-4xl mt-30 text-center">
        <h1 className="text-3xl pb-2">Упатство за користење</h1>
        <p>Како се користи Конекта профилот и производите</p>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Како се користат токените (картичка, налепница...)?</h2>
        <h3 className="font-[800]">Споделување преку NFC</h3>
        <ol className="list-decimal pl-5">
          <li>Отклучете го телефонот</li>
          <li>Приближете го токенот до задниот дел на телефонот (најчесто во горниот агол до камерите)</li>
          <li>На екранот ќе се прикаже известување - кликнете на известувањето за да се отвори линкот</li>
        </ol>
        <h3 className="font-[800] pt-2">Доколку не работи</h3>
        <ul className="list-disc pl-5">
          <li>Притиснете го токенот до телефонот или лизгајте по телефонот (можеби NFC приемникот на конкретниот телефон се наоѓа на друго место.)</li>
          <li>Проверете дали NFC е вклучено (Settings - Connections - NFC)</li>
          <li>Работи на iPhone XR и понови модели, и повеќето Android телефони произведени од 2016 година па нагоре.</li>
        </ul>
        <h3 className="font-[800] pt-4">Споделување преку QR код</h3>
        <ol className="list-decimal pl-5">
          <li>Отворете ја камерата на телефонот</li>
          <li>Насочете ја камерата кон QR кодот (како да пробувате да го фотографирате)</li>
          <li>На екранот ќе се прикаже известување - кликнете на известувањето за да се отвори линкот</li>
        </ol>
        <h3 className="font-[800] pt-2">Доколку не работи</h3>
        <ul className="list-disc pl-5">
          <li>На некои модели има вградена апликација за скенирање QR кодови која треба да ја пронајдете</li>
          <li>На некои модели <strong>нема</strong> вградена опција за скенирање QR кодови, па ќе треба да превземете апликација од соодветната продавница (iPhone - App Store, Android - Google Play, Huawei - AppGallery)</li>
        </ul>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Каде може да се постави NFC налепницата?</h2>
        <p>Налепницата можете да ја поставите на секоја рамна површина каде што ќе ви биде од најголема корист (пр. мобилен телефон, лаптоп, автомобил, во канцеларија...)</p>
        <p>Доколку сакате да ја залепите на мобилниот телефон, внимавајте на позицијата на NFC приемникот за да не се вклучува постојано приемникот (најчесто е во горниот агол спротивно на камерите). <br />Најдобро е прво да пробате каде реагира токенот па потоа да го залепите.</p>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Како се споделува профилот преку линк?</h2>
        <h3 className="font-[800]">Копирање на линкот</h3>
        <ul className="list-disc pl-5">
          <li>Отворете го линкот од NFC токенот</li>
          <li>Кликнете и задржете на лентата за адресата, и одберете "Copy" (копирај).</li>
        </ul>
        <h3 className="font-[800] pt-2">Споделување на линкот</h3>
        <ul className="list-disc pl-5">
          <h4>Преку порака:</h4>
          <li>Отворете ја саканата апликација за праќање пораки</li>
          <li>Кликнете и задржете на лентата за пишување, и одберете "Paste" (Залепи), па потоа испратете</li>
          <h4 className="pt-2">Преку AirDrop / Nearby Share</h4>
          <li>Android: Отворете "Share" (Сподели) - одберете "Nearby Share" - одберете уред</li>
          <li>iPhone: Отворете "Share" (Сподели) - одберете "AirDrop" - одберете контакт</li>
        </ul>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Како се креира Конекта профил?</h2>
        <ul className="list-disc pl-5">
          <li>Креирајте профил преку Google и одберете го вашето корисничко име</li>
          <p className="bg-[#fecaca] my-2 p-4 text-[#991b1b]">Важно: Корисничкото име не може да се промени. Тоа ќе стои во вашиот линк. <br />(пр. https://konekta.mk/korisnickoIme)</p>
          <li>Пополнете ги вашите информации во соодветните полиња</li>
          <li>Во горниот дел можете да одберете боја или фотографија, понежна нијанса од одбраната боја ќе се прикаже на позадината на профилот</li>
          <li>По направените промени не заборавајте да кликнете „Зачувај“</li>
          <li>На страната „Аналитика“ може да видите колку пати е посетен вашиот профил и колку кликови има на вашите линкови</li>
        </ul>
      </section>
      <section className="max-w-4xl mb-20">
        <h3>Доколку имате било какви прашања во врска со нашите производи или профилот слободно контактирајте не.</h3>
      </section>
    </main>
  );
}