export default function Kolacinja() {
  return (
    <main>
      <section className="max-w-4xl mt-30 text-center">
        <h1 className="text-3xl pb-2">Политика за колачиња (cookies)</h1>
        <p>Како речиси секоја модерна веб-страница, и Конекта користи колачиња – но само оние кои се навистина потребни.</p>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Што се колачиња?</h2>
        <p>Колачињата се мали текстуални фајлови што се зачувуваат во вашиот прелистувач кога ја посетувате нашата веб-страница. Тие ни помагаат да запаметиме одредени информации и да ви овозможиме подобро и побрзо корисничко искуство.</p>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Какви колачиња користиме?</h2>
        <div>
          <h3 className="font-[800]">Основни колачиња</h3>
          <p>Овие се неопходни за веб-страницата да функционира правилно – како на пример паметење на јазик, вчитување на профили или обработка на нарачки.</p>
        </div>
        <div>
          <h3 className="font-[800]">Колачиња за аналитика (по избор)</h3>
          <p>Можеме да користиме колачиња за анализа (на пр. Google Analytics) за да разбереме како луѓето ја користат Конекта и што можеме да подобриме. Исто така се користат за прикажување аналитика во вашиот конекта профил, односно кој го посетил вашиот профил и колку кликови има на вашите линкови.</p>
          <p className="font-[700]">Овие колачиња не ве идентификуваат лично, и се користат исклучиво за подобрување на искуството.</p>
        </div>
        <div>
          <h3 className="font-[800]">Не користиме колачиња за рекламирање</h3>
          <p>Вашите податоци <strong>НЕ</strong> ги следиме за реклами, <strong>ниту</strong> ги споделуваме со рекламни мрежи.</p>
          <p><strong>Ние не продаваме внимание – го заслужуваме.</strong></p>
        </div>
      </section>
      <section className="max-w-4xl flex flex-col gap-2">
        <h2>Како можете да ги контролирате?</h2>
        <p>Секогаш можете да ги избришете или блокирате колачињата преку поставките на вашиот прелистувач.</p>
          <p>Но имајте предвид: ако ги исклучите основните колачиња, некои делови од сајтот можеби нема да функционираат правилно.</p>
      </section>
      <section className="max-w-4xl mb-20 flex flex-col gap-2">
        <h2>Промени во политиката</h2>
        <p>Ако во иднина направиме промени во начинот на користење на колачиња, ќе ја ажурираме оваа страница.</p>
      </section>
    </main>
  );
}